Autodesk.Revit.DB.IEntitlementExternalServer.EnsureToEnableCloudWorksharing
Shows a dialog for users to ensure if user really wants to enable cloud worksharing.
Returns:
Indicates whether the user really wants to enable cloud worksharing.
Since:
2019

Autodesk.Revit.DB.IEntitlementExternalServer.ShowNoWorksharedCloudModelEntitlementWindow
Shows a dialog saying "You don't have access of Workshared Cloud Model entitlement".
Since:
2019

Autodesk.Revit.DB.IEntitlementExternalServer.HasCloudModelEntitlement
Checks if the current user has Non-workshared Cloud Model entitlement.
Returns:
Indicates whether the current user has Non-workshared Cloud Model entitlement
Since:
2019

Autodesk.Revit.DB.IEntitlementExternalServer.HasWorksharedCloudModelEntitlement
Checks if the current user has Workshared Cloud Model entitlement.
Returns:
Indicates whether the current user has Workshared Cloud Model entitlement
Since:
2019

Autodesk.Revit.DB.IEntitlementExternalServer
The interface used to get the entitlement information (Workshared Cloud Model entitlement or Non-workshared Cloud Model entitlement or none).
Remarks:
Implement this interface and register an instance of the derived class with the EntitlementExternalService.
Since:
2019